blog/content/post/ai-math-foundations.org
+++
title = "02 - AI Engineering from scratch: a matemática que a IA realmente usa"
description = "De vetores a processos estocásticos, o que você precisa de matemática pra entender o que acontece dentro de uma rede neural"
date = 2026-05-25T14:00:00-03:00
tags = ["AI", "math", "linear-algebra", "calculus", "probability", "optimization", "python"]
draft = true
weight = 1
author = "Vitor Lobo Ramos"
+++


Matemática assusta. E matemática pra IA assusta mais ainda, porque você ouve termos como "decomposição em valores singulares", "retropropagação via regra da cadeia" e "amostragem de Metropolis-Hastings" antes mesmo de ter certeza do que é um autovalor. A sensação é de que você precisa de um doutorado antes de importar o PyTorch.

Não precisa.

A matemática que a IA usa de verdade cabe em quatro grandes blocos. Álgebra linear (tudo é tensor, tudo é multiplicação de matriz). Cálculo e otimização (como o modelo aprende, como a loss desce o morro). Probabilidade e estatística (como o modelo lida com incerteza, como você avalia se ele presta). E um quarto bloco de tópicos aplicados que conectam esses três ao mundo real: teoria da informação, redução de dimensionalidade, estabilidade numérica, Fourier.

Este artigo percorre os quatro blocos. Cada seção explica o conceito, mostra a fórmula (sem abuso de notação), conecta com a IA e, onde couber, traz código Python ou Go. O objetivo não é te transformar em matemático. É te dar vocabulário e intuição pra ler um paper, debugar um gradiente que explodiu e saber o que está acontecendo quando o ~torch.linalg.svd~ roda.

Nada de magia. Vamos lá.

* Álgebra linear: a língua franca da IA

Tudo no PyTorch é tensor. Toda camada de rede neural é multiplicação de matriz. Todo score de atenção é produto escalar. Se você entende álgebra linear, você entende o esqueleto de qualquer modelo.

** Vetores, matrizes e o que eles representam

Um vetor é uma lista de números. Pode ser um ponto no espaço (~[x, y, z]~), uma direção, ou um embedding de palavra. Uma matriz é uma tabela de números: linhas e colunas. Pode ser uma transformação (rotacionar vetores), um lote de embeddings, ou os pesos de uma camada densa.

O produto escalar mede similaridade: ~a·b = Σ a_i b_i~. Se o resultado é alto, os vetores apontam na mesma direção. Se é zero, são ortogonais. Toda atenção de transformer usa produto escalar: a query e a key são vetores, e o score de atenção é o produto escalar entre eles.

O produto matriz-vetor ~W @ x~ aplica uma transformação linear. Toda camada fully-connected de rede neural é exatamente isso: ~output = ReLU(W @ x + b)~. O ~W~ são os pesos que o treino ajusta.

#+BEGIN_SRC python
import numpy as np

# Produto escalar: quão similares são dois vetores?
a = np.array([1, 0, 1])
b = np.array([0, 1, 1])
similaridade = np.dot(a, b)  # 1

# Produto matriz-vetor: toda camada densa de rede neural
W = np.random.randn(128, 784)  # pesos
x = np.random.randn(784)        # input (imagem achatada)
output = W @ x                   # shape (128,)
#+END_SRC

