ai-math-foundations/index.html
<!DOCTYPE html>
<html lang="pt-br">
<head>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <link rel="icon" href="data:,">
  <title>02 - AI Engineering from scratch: a matemática que a IA realmente usa — lobovit</title>
  <link rel="stylesheet" href="/css/main.css?v=3">
  <link rel="stylesheet" href="/vendor/fonts/fonts.css">
  <link rel="stylesheet" href="/vendor/prism/prism-mocha.min.css">
</head>
<body>
  <div class="frame">
    <header>
      <nav>
        <a class="site-title" href="https://lobovit.github.io/">lobovit</a>
        <span class="nav-links">
          <a href="/page/about/">about</a>
          <a href="/page/contact/">contact</a>
        </span>
      </nav>
      <hr>
    </header>
    <main>
      
<article>
  <header>
    <h1>02 - AI Engineering from scratch: a matemática que a IA realmente usa</h1>
    <p class="meta"><time>2026-05-25</time> · <span class="tag">AI</span><span class="tag">math</span><span class="tag">linear-algebra</span><span class="tag">calculus</span><span class="tag">probability</span><span class="tag">optimization</span><span class="tag">python</span></p>
  </header>
  <div class="content">
    
<p>
Matemática assusta. E matemática pra IA assusta mais ainda, porque você ouve termos como &#34;decomposição em valores singulares&#34;, &#34;retropropagação via regra da cadeia&#34; e &#34;amostragem de Metropolis-Hastings&#34; antes mesmo de ter certeza do que é um autovalor. A sensação é de que você precisa de um doutorado antes de importar o PyTorch.</p>
<p>
Não precisa.</p>
<p>
A matemática que a IA usa de verdade cabe em quatro grandes blocos. Álgebra linear (tudo é tensor, tudo é multiplicação de matriz). Cálculo e otimização (como o modelo aprende, como a loss desce o morro). Probabilidade e estatística (como o modelo lida com incerteza, como você avalia se ele presta). E um quarto bloco de tópicos aplicados que conectam esses três ao mundo real: teoria da informação, redução de dimensionalidade, estabilidade numérica, Fourier.</p>
<p>
Este artigo percorre os quatro blocos. Cada seção explica o conceito, mostra a fórmula (sem abuso de notação), conecta com a IA e, onde couber, traz código Python ou Go. O objetivo não é te transformar em matemático. É te dar vocabulário e intuição pra ler um paper, debugar um gradiente que explodiu e saber o que está acontecendo quando o <code>torch.linalg.svd</code> roda.</p>
<p>
Nada de magia. Vamos lá.</p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Álgebra linear: a língua franca da IA
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>
Tudo no PyTorch é tensor. Toda camada de rede neural é multiplicação de matriz. Todo score de atenção é produto escalar. Se você entende álgebra linear, você entende o esqueleto de qualquer modelo.</p>
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
Vetores, matrizes e o que eles representam
</h3>
<div id="outline-text-headline-2" class="outline-text-3">
<p>
Um vetor é uma lista de números. Pode ser um ponto no espaço (<code>[x, y, z]</code>), uma direção, ou um embedding de palavra. Uma matriz é uma tabela de números: linhas e colunas. Pode ser uma transformação (rotacionar vetores), um lote de embeddings, ou os pesos de uma camada densa.</p>
<p>
O produto escalar mede similaridade: <code>a·b = Σ a_i b_i</code>. Se o resultado é alto, os vetores apontam na mesma direção. Se é zero, são ortogonais. Toda atenção de transformer usa produto escalar: a query e a key são vetores, e o score de atenção é o produto escalar entre eles.</p>
<p>
O produto matriz-vetor <code>W @ x</code> aplica uma transformação linear. Toda camada fully-connected de rede neural é exatamente isso: <code>output = ReLU(W @ x + b)</code>. O <code>W</code> são os pesos que o treino ajusta.</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">numpy</span> <span class="k">as</span> <span class="nn">np</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Produto escalar: quão similares são dois vetores?</span>
</span></span><span class="line"><span class="cl"><span class="n">a</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">array</span><span class="p">([</span><span class="mi">1</span><span class="p">,</span> <span class="mi">0</span><span class="p">,</span> <span class="mi">1</span><span class="p">])</span>
</span></span><span class="line"><span class="cl"><span class="n">b</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">array</span><span class="p">([</span><span class="mi">0</span><span class="p">,</span> <span class="mi">1</span><span class="p">,</span> <span class="mi">1</span><span class="p">])</span>
</span></span><span class="line"><span class="cl"><span class="n">similaridade</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">dot</span><span class="p">(</span><span class="n">a</span><span class="p">,</span> <span class="n">b</span><span class="p">)</span>  <span class="c1"># 1</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Produto matriz-vetor: toda camada densa de rede neural</span>
</span></span><span class="line"><span class="cl"><span class="n">W</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">random</span><span class="o">.</span><span class="n">randn</span><span class="p">(</span><span class="mi">128</span><span class="p">,</span> <span class="mi">784</span><span class="p">)</span>  <span class="c1"># pesos</span>
</span></span><span class="line"><span class="cl"><span class="n">x</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">random</span><span class="o">.</span><span class="n">randn</span><span class="p">(</span><span class="mi">784</span><span class="p">)</span>        <span class="c1"># input (imagem achatada)</span>
</span></span><span class="line"><span class="cl"><span class="n">output</span> <span class="o">=</span> <span class="n">W</span> <span class="o">@</span> <span class="n">x</span>                   <span class="c1"># shape (128,)</span></span></span></code></pre></div>
</div>
</div>
</div>
