blog/content/post/ai-math-foundations.org
** Transformações: rotacionar, escalar, cisalhar

Multiplicar por uma matriz transforma o espaço. Uma matriz de rotação gira vetores sem mudar o comprimento. Uma matriz diagonal escala cada eixo independentemente. Uma matriz de cisalhamento inclina.

Essa intuição visual importa porque autovalores e autovetores descrevem as direções que uma transformação "preserva". Se ~A @ v = λ v~, então aplicar A ao vetor v só multiplica ele por λ, sem mudar a direção. Autovalores são a chave do PCA (os componentes principais são os autovetores da matriz de covariância). E são também o diagnóstico de vanishing/exploding gradients em RNNs: se o maior autovalor da matriz de recorrência for maior que 1, gradientes explodem; se for menor, desaparecem.

#+BEGIN_SRC python
import numpy as np

theta = np.pi / 4  # 45 graus
R = np.array([[np.cos(theta), -np.sin(theta)],
              [np.sin(theta),  np.cos(theta)]])
v = np.array([1, 0])
print(R @ v)  # [0.707, 0.707], girado 45 graus

# Autovalores e autovetores
A = np.array([[2, 1], [1, 2]])
eigenvalues, eigenvectors = np.linalg.eig(A)
print(eigenvalues)  # [3, 1], as direções preservadas
#+END_SRC

#+BEGIN_QUOTE
/Em miúdos:/ ~Autovalor~ é o fator pelo qual uma transformação estica ou encolhe um vetor numa direção específica. ~Autovetor~ é a direção que não muda (só estica ou encolhe). Pense numa foto sendo ampliada: as bordas crescem, mas as linhas do chão continuam paralelas. ~Determinante~ é o fator de escala do volume: se ~det(A) = 0~, a matriz achata o espaço numa dimensão menor e não tem inversa. ~Posto (rank)~ é quantas dimensões a matriz realmente ocupa depois da transformação.
#+END_QUOTE

** SVD: a decomposição que explica tudo

A decomposição em valores singulares (SVD) fatura qualquer matriz em três pedaços: ~A = U Σ V^T~. O ~U~ são os vetores singulares esquerdos, o ~V^T~ os direitos, e o ~Σ~ é uma matriz diagonal com os valores singulares em ordem decrescente de importância.

O SVD é onipresente na IA: compressão de imagens (joga fora os valores singulares pequenos), sistemas de recomendação (fatoração de matriz usuário-item, o que a Netflix usava), LSA em NLP (fatoração da matriz termo-documento), e o PCA do scikit-learn é implementado com SVD por baixo.

#+BEGIN_SRC python
import numpy as np

A = np.random.randn(5, 3)
U, S, Vt = np.linalg.svd(A, full_matrices=False)

# Reconstrução com k=2 componentes
k = 2
A_approx = U[:, :k] @ np.diag(S[:k]) @ Vt[:k, :]
erro = np.linalg.norm(A - A_approx)
print(f"Erro de reconstrução com k={k}: {erro:.4f}")
#+END_SRC

** Tensores e einsum

Tensor é a generalização de matriz pra N dimensões. Escalar é tensor 0D, vetor é 1D, matriz é 2D, e assim vai. Uma imagem RGB em batch é um tensor 4D: ~[batch, canais, altura, largura]~. Toda operação no PyTorch preserva ou contrai dimensões.

O ~einsum~ é uma notação compacta que substitue dezenas de linhas de reshape/transpose/matmul. Ele usa a convenção de Einstein: índices repetidos são somados.

#+BEGIN_SRC python
import numpy as np

# Matmul: ik,kj -> ij
A = np.random.randn(3, 4)
B = np.random.randn(4, 5)
C = np.einsum('ik,kj->ij', A, B)  # mesmo que A @ B

# Atenção multi-cabeça: bhtd,bhsd -> bhts
Q = np.random.randn(2, 8, 10, 64)  # batch, heads, tokens, dim
K = np.random.randn(2, 8, 10, 64)
scores = np.einsum('bhtd,bhsd->bhts', Q, K)
#+END_SRC

