ai-math-foundations/index.html
<div id="outline-container-headline-3" class="outline-3">
<h3 id="headline-3">
Transformações: rotacionar, escalar, cisalhar
</h3>
<div id="outline-text-headline-3" class="outline-text-3">
<p>
Multiplicar por uma matriz transforma o espaço. Uma matriz de rotação gira vetores sem mudar o comprimento. Uma matriz diagonal escala cada eixo independentemente. Uma matriz de cisalhamento inclina.</p>
<p>
Essa intuição visual importa porque autovalores e autovetores descrevem as direções que uma transformação &#34;preserva&#34;. Se <code>A @ v = λ v</code>, então aplicar A ao vetor v só multiplica ele por λ, sem mudar a direção. Autovalores são a chave do PCA (os componentes principais são os autovetores da matriz de covariância). E são também o diagnóstico de vanishing/exploding gradients em RNNs: se o maior autovalor da matriz de recorrência for maior que 1, gradientes explodem; se for menor, desaparecem.</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">numpy</span> <span class="k">as</span> <span class="nn">np</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="n">theta</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">pi</span> <span class="o">/</span> <span class="mi">4</span>  <span class="c1"># 45 graus</span>
</span></span><span class="line"><span class="cl"><span class="n">R</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">array</span><span class="p">([[</span><span class="n">np</span><span class="o">.</span><span class="n">cos</span><span class="p">(</span><span class="n">theta</span><span class="p">),</span> <span class="o">-</span><span class="n">np</span><span class="o">.</span><span class="n">sin</span><span class="p">(</span><span class="n">theta</span><span class="p">)],</span>
</span></span><span class="line"><span class="cl">              <span class="p">[</span><span class="n">np</span><span class="o">.</span><span class="n">sin</span><span class="p">(</span><span class="n">theta</span><span class="p">),</span>  <span class="n">np</span><span class="o">.</span><span class="n">cos</span><span class="p">(</span><span class="n">theta</span><span class="p">)]])</span>
</span></span><span class="line"><span class="cl"><span class="n">v</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">array</span><span class="p">([</span><span class="mi">1</span><span class="p">,</span> <span class="mi">0</span><span class="p">])</span>
</span></span><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="n">R</span> <span class="o">@</span> <span class="n">v</span><span class="p">)</span>  <span class="c1"># [0.707, 0.707], girado 45 graus</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Autovalores e autovetores</span>
</span></span><span class="line"><span class="cl"><span class="n">A</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">array</span><span class="p">([[</span><span class="mi">2</span><span class="p">,</span> <span class="mi">1</span><span class="p">],</span> <span class="p">[</span><span class="mi">1</span><span class="p">,</span> <span class="mi">2</span><span class="p">]])</span>
</span></span><span class="line"><span class="cl"><span class="n">eigenvalues</span><span class="p">,</span> <span class="n">eigenvectors</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">linalg</span><span class="o">.</span><span class="n">eig</span><span class="p">(</span><span class="n">A</span><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="n">eigenvalues</span><span class="p">)</span>  <span class="c1"># [3, 1], as direções preservadas</span></span></span></code></pre></div>
</div>
<blockquote>
<p><em>Em miúdos:</em> <code>Autovalor</code> é o fator pelo qual uma transformação estica ou encolhe um vetor numa direção específica. <code>Autovetor</code> é a direção que não muda (só estica ou encolhe). Pense numa foto sendo ampliada: as bordas crescem, mas as linhas do chão continuam paralelas. <code>Determinante</code> é o fator de escala do volume: se <code>det(A) = 0</code>, a matriz achata o espaço numa dimensão menor e não tem inversa. <code>Posto (rank)</code> é quantas dimensões a matriz realmente ocupa depois da transformação.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
SVD: a decomposição que explica tudo
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<p>
A decomposição em valores singulares (SVD) fatura qualquer matriz em três pedaços: <code>A = U Σ V^T</code>. O <code>U</code> são os vetores singulares esquerdos, o <code>V^T</code> os direitos, e o <code>Σ</code> é uma matriz diagonal com os valores singulares em ordem decrescente de importância.</p>
<p>
O SVD é onipresente na IA: compressão de imagens (joga fora os valores singulares pequenos), sistemas de recomendação (fatoração de matriz usuário-item, o que a Netflix usava), LSA em NLP (fatoração da matriz termo-documento), e o PCA do scikit-learn é implementado com SVD por baixo.</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">numpy</span> <span class="k">as</span> <span class="nn">np</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="n">A</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">random</span><span class="o">.</span><span class="n">randn</span><span class="p">(</span><span class="mi">5</span><span class="p">,</span> <span class="mi">3</span><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="n">U</span><span class="p">,</span> <span class="n">S</span><span class="p">,</span> <span class="n">Vt</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">linalg</span><span class="o">.</span><span class="n">svd</span><span class="p">(</span><span class="n">A</span><span class="p">,</span> <span class="n">full_matrices</span><span class="o">=</span><span class="kc">False</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Reconstrução com k=2 componentes</span>
</span></span><span class="line"><span class="cl"><span class="n">k</span> <span class="o">=</span> <span class="mi">2</span>
</span></span><span class="line"><span class="cl"><span class="n">A_approx</span> <span class="o">=</span> <span class="n">U</span><span class="p">[:,</span> <span class="p">:</span><span class="n">k</span><span class="p">]</span> <span class="o">@</span> <span class="n">np</span><span class="o">.</span><span class="n">diag</span><span class="p">(</span><span class="n">S</span><span class="p">[:</span><span class="n">k</span><span class="p">])</span> <span class="o">@</span> <span class="n">Vt</span><span class="p">[:</span><span class="n">k</span><span class="p">,</span> <span class="p">:]</span>
</span></span><span class="line"><span class="cl"><span class="n">erro</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">linalg</span><span class="o">.</span><span class="n">norm</span><span class="p">(</span><span class="n">A</span> <span class="o">-</span> <span class="n">A_approx</span><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="sa">f</span><span class="s2">&#34;Erro de reconstrução com k=</span><span class="si">{</span><span class="n">k</span><span class="si">}</span><span class="s2">: </span><span class="si">{</span><span class="n">erro</span><span class="si">:</span><span class="s2">.4f</span><span class="si">}</span><span class="s2">&#34;</span><span class="p">)</span></span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
Tensores e einsum
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<p>
Tensor é a generalização de matriz pra N dimensões. Escalar é tensor 0D, vetor é 1D, matriz é 2D, e assim vai. Uma imagem RGB em batch é um tensor 4D: <code>[batch, canais, altura, largura]</code>. Toda operação no PyTorch preserva ou contrai dimensões.</p>
<p>
O <code>einsum</code> é uma notação compacta que substitue dezenas de linhas de reshape/transpose/matmul. Ele usa a convenção de Einstein: índices repetidos são somados.</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">numpy</span> <span class="k">as</span> <span class="nn">np</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Matmul: ik,kj -&gt; ij</span>
</span></span><span class="line"><span class="cl"><span class="n">A</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">random</span><span class="o">.</span><span class="n">randn</span><span class="p">(</span><span class="mi">3</span><span class="p">,</span> <span class="mi">4</span><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="n">B</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">random</span><span class="o">.</span><span class="n">randn</span><span class="p">(</span><span class="mi">4</span><span class="p">,</span> <span class="mi">5</span><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="n">C</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">einsum</span><span class="p">(</span><span class="s1">&#39;ik,kj-&gt;ij&#39;</span><span class="p">,</span> <span class="n">A</span><span class="p">,</span> <span class="n">B</span><span class="p">)</span>  <span class="c1"># mesmo que A @ B</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Atenção multi-cabeça: bhtd,bhsd -&gt; bhts</span>
</span></span><span class="line"><span class="cl"><span class="n">Q</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">random</span><span class="o">.</span><span class="n">randn</span><span class="p">(</span><span class="mi">2</span><span class="p">,</span> <span class="mi">8</span><span class="p">,</span> <span class="mi">10</span><span class="p">,</span> <span class="mi">64</span><span class="p">)</span>  <span class="c1"># batch, heads, tokens, dim</span>
</span></span><span class="line"><span class="cl"><span class="n">K</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">random</span><span class="o">.</span><span class="n">randn</span><span class="p">(</span><span class="mi">2</span><span class="p">,</span> <span class="mi">8</span><span class="p">,</span> <span class="mi">10</span><span class="p">,</span> <span class="mi">64</span><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="n">scores</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">einsum</span><span class="p">(</span><span class="s1">&#39;bhtd,bhsd-&gt;bhts&#39;</span><span class="p">,</span> <span class="n">Q</span><span class="p">,</span> <span class="n">K</span><span class="p">)</span></span></span></code></pre></div>
</div>
</div>
</div>
