blog/content/post/ai-math-foundations.org
** Sistemas lineares e regressão

No fundo, regressão linear é resolver ~X @ w = y~ pra encontrar os pesos ~w~. As equações normais dão a solução fechada: ~w = (X^T X)^(-1) X^T y~. Adicionar regularização L2 (Ridge) vira ~w = (X^T X + λI)^(-1) X^T y~.

Na prática, ninguém inverte matriz grande. Usa-se decomposições: LU (matrizes quadradas), Cholesky (simétricas positivas definidas, como kernels de Gaussian Processes), QR (mínimos quadrados estáveis, inicialização ortogonal de pesos). O número de condição ~κ(A) = σ_max / σ_min~ mede quão sensível o sistema é a erros numéricos: se for alto, pequenas variações nos dados produzem grandes variações na solução (multicolinearidade).

#+BEGIN_SRC python
import numpy as np

X = np.random.randn(100, 5)
y = X @ np.array([1, -2, 3, -4, 5]) + np.random.randn(100) * 0.1

# Equações normais
w = np.linalg.inv(X.T @ X) @ X.T @ y
print(w)

# Ridge
lam = 1.0
w_ridge = np.linalg.inv(X.T @ X + lam * np.eye(5)) @ X.T @ y
print(w_ridge)
#+END_SRC

** Grafos e GNNs

Um grafo é um monte de nós conectados por arestas. A matriz de adjacência ~A~ tem ~A[i][j] = 1~ se o nó i conecta ao j. O Laplaciano ~L = D - A~ (onde D é a matriz de graus) concentra toda a estrutura do grafo. O segundo menor autovalor do Laplaciano (o /Fiedler vector/) indica como partir o grafo em duas comunidades, isso é spectral clustering.

Graph Neural Networks (GNNs) operam por passagem de mensagem: cada nó agrega informação dos vizinhos, aplica uma transformação linear e passa adiante. A fórmula da GCN é ~H^(l+1) = σ(D_hat^(-½) A_hat D_hat^(-½) H^(l) W^(l))~. No fundo, é multiplicação de matriz esparsa com pesos aprendidos.

#+BEGIN_SRC python
import numpy as np

# Grafo: 4 nós, arestas 0-1, 1-2, 2-3
A = np.array([[0, 1, 0, 0],
              [1, 0, 1, 0],
              [0, 1, 0, 1],
              [0, 0, 1, 0]])
D = np.diag(A.sum(axis=1))
L = D - A  # Laplaciano

# Spectral clustering: segundo menor autovalor
eigenvalues, eigenvectors = np.linalg.eigh(L)
fiedler = eigenvectors[:, 1]
particao = fiedler > 0
print(particao)  # [False, False, True, True], dois grupos
#+END_SRC

* Cálculo e otimização: como o modelo aprende

Se álgebra linear é o esqueleto, cálculo é o sistema nervoso. É ele que diz "ajuste o peso 0.003 pra esquerda e 0.001 pra baixo". Toda rede neural aprende descendo o gradiente da função de perda.

** Derivadas, gradientes e gradiente descendente

A derivada mede a taxa de variação instantânea: se ~f(x) = x²~, então ~f'(x) = 2x~. Em ~x = 3~, a derivada é 6: um passo infinitesimal pra direita aumenta a função 6 vezes mais rápido. O gradiente é a derivada pra funções de múltiplas variáveis: um vetor que aponta na direção de maior crescimento. O gradiente descendente anda na direção oposta (a de maior /decrescimento/).

#+BEGIN_SRC python
import numpy as np

def gradiente_descendente(f_grad, x0, lr=0.01, steps=100):
    x = x0.copy()
    for _ in range(steps):
        x -= lr * f_grad(x)
    return x

# Minimizar f(x,y) = x² + y²
f_grad = lambda x: 2 * x
minimo = gradiente_descendente(f_grad, np.array([5.0, 5.0]))
print(minimo)  # [~0, ~0]
#+END_SRC

