ai-math-foundations/index.html
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
Sistemas lineares e regressão
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<p>
No fundo, regressão linear é resolver <code>X @ w = y</code> pra encontrar os pesos <code>w</code>. As equações normais dão a solução fechada: <code>w = (X^T X)^(-1) X^T y</code>. Adicionar regularização L2 (Ridge) vira <code>w = (X^T X + λI)^(-1) X^T y</code>.</p>
<p>
Na prática, ninguém inverte matriz grande. Usa-se decomposições: LU (matrizes quadradas), Cholesky (simétricas positivas definidas, como kernels de Gaussian Processes), QR (mínimos quadrados estáveis, inicialização ortogonal de pesos). O número de condição <code>κ(A) = σ_max / σ_min</code> mede quão sensível o sistema é a erros numéricos: se for alto, pequenas variações nos dados produzem grandes variações na solução (multicolinearidade).</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">numpy</span> <span class="k">as</span> <span class="nn">np</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="n">X</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">random</span><span class="o">.</span><span class="n">randn</span><span class="p">(</span><span class="mi">100</span><span class="p">,</span> <span class="mi">5</span><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="n">y</span> <span class="o">=</span> <span class="n">X</span> <span class="o">@</span> <span class="n">np</span><span class="o">.</span><span class="n">array</span><span class="p">([</span><span class="mi">1</span><span class="p">,</span> <span class="o">-</span><span class="mi">2</span><span class="p">,</span> <span class="mi">3</span><span class="p">,</span> <span class="o">-</span><span class="mi">4</span><span class="p">,</span> <span class="mi">5</span><span class="p">])</span> <span class="o">+</span> <span class="n">np</span><span class="o">.</span><span class="n">random</span><span class="o">.</span><span class="n">randn</span><span class="p">(</span><span class="mi">100</span><span class="p">)</span> <span class="o">*</span> <span class="mf">0.1</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Equações normais</span>
</span></span><span class="line"><span class="cl"><span class="n">w</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">linalg</span><span class="o">.</span><span class="n">inv</span><span class="p">(</span><span class="n">X</span><span class="o">.</span><span class="n">T</span> <span class="o">@</span> <span class="n">X</span><span class="p">)</span> <span class="o">@</span> <span class="n">X</span><span class="o">.</span><span class="n">T</span> <span class="o">@</span> <span class="n">y</span>
</span></span><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="n">w</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Ridge</span>
</span></span><span class="line"><span class="cl"><span class="n">lam</span> <span class="o">=</span> <span class="mf">1.0</span>
</span></span><span class="line"><span class="cl"><span class="n">w_ridge</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">linalg</span><span class="o">.</span><span class="n">inv</span><span class="p">(</span><span class="n">X</span><span class="o">.</span><span class="n">T</span> <span class="o">@</span> <span class="n">X</span> <span class="o">+</span> <span class="n">lam</span> <span class="o">*</span> <span class="n">np</span><span class="o">.</span><span class="n">eye</span><span class="p">(</span><span class="mi">5</span><span class="p">))</span> <span class="o">@</span> <span class="n">X</span><span class="o">.</span><span class="n">T</span> <span class="o">@</span> <span class="n">y</span>
</span></span><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="n">w_ridge</span><span class="p">)</span></span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
Grafos e GNNs
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<p>
Um grafo é um monte de nós conectados por arestas. A matriz de adjacência <code>A</code> tem <code>A[i][j] = 1</code> se o nó i conecta ao j. O Laplaciano <code>L = D - A</code> (onde D é a matriz de graus) concentra toda a estrutura do grafo. O segundo menor autovalor do Laplaciano (o <em>Fiedler vector</em>) indica como partir o grafo em duas comunidades, isso é spectral clustering.</p>
<p>
Graph Neural Networks (GNNs) operam por passagem de mensagem: cada nó agrega informação dos vizinhos, aplica uma transformação linear e passa adiante. A fórmula da GCN é <code>H^(l+1) = σ(D_hat^(-½) A_hat D_hat^(-½) H^(l) W^(l))</code>. No fundo, é multiplicação de matriz esparsa com pesos aprendidos.</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">numpy</span> <span class="k">as</span> <span class="nn">np</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Grafo: 4 nós, arestas 0-1, 1-2, 2-3</span>
</span></span><span class="line"><span class="cl"><span class="n">A</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">array</span><span class="p">([[</span><span class="mi">0</span><span class="p">,</span> <span class="mi">1</span><span class="p">,</span> <span class="mi">0</span><span class="p">,</span> <span class="mi">0</span><span class="p">],</span>
</span></span><span class="line"><span class="cl">              <span class="p">[</span><span class="mi">1</span><span class="p">,</span> <span class="mi">0</span><span class="p">,</span> <span class="mi">1</span><span class="p">,</span> <span class="mi">0</span><span class="p">],</span>
</span></span><span class="line"><span class="cl">              <span class="p">[</span><span class="mi">0</span><span class="p">,</span> <span class="mi">1</span><span class="p">,</span> <span class="mi">0</span><span class="p">,</span> <span class="mi">1</span><span class="p">],</span>
</span></span><span class="line"><span class="cl">              <span class="p">[</span><span class="mi">0</span><span class="p">,</span> <span class="mi">0</span><span class="p">,</span> <span class="mi">1</span><span class="p">,</span> <span class="mi">0</span><span class="p">]])</span>
</span></span><span class="line"><span class="cl"><span class="n">D</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">diag</span><span class="p">(</span><span class="n">A</span><span class="o">.</span><span class="n">sum</span><span class="p">(</span><span class="n">axis</span><span class="o">=</span><span class="mi">1</span><span class="p">))</span>
</span></span><span class="line"><span class="cl"><span class="n">L</span> <span class="o">=</span> <span class="n">D</span> <span class="o">-</span> <span class="n">A</span>  <span class="c1"># Laplaciano</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Spectral clustering: segundo menor autovalor</span>
</span></span><span class="line"><span class="cl"><span class="n">eigenvalues</span><span class="p">,</span> <span class="n">eigenvectors</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">linalg</span><span class="o">.</span><span class="n">eigh</span><span class="p">(</span><span class="n">L</span><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="n">fiedler</span> <span class="o">=</span> <span class="n">eigenvectors</span><span class="p">[:,</span> <span class="mi">1</span><span class="p">]</span>
</span></span><span class="line"><span class="cl"><span class="n">particao</span> <span class="o">=</span> <span class="n">fiedler</span> <span class="o">&gt;</span> <span class="mi">0</span>
</span></span><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="n">particao</span><span class="p">)</span>  <span class="c1"># [False, False, True, True], dois grupos</span></span></span></code></pre></div>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-8" class="outline-2">
<h2 id="headline-8">
Cálculo e otimização: como o modelo aprende
</h2>
<div id="outline-text-headline-8" class="outline-text-2">
<p>
Se álgebra linear é o esqueleto, cálculo é o sistema nervoso. É ele que diz &#34;ajuste o peso 0.003 pra esquerda e 0.001 pra baixo&#34;. Toda rede neural aprende descendo o gradiente da função de perda.</p>
<div id="outline-container-headline-9" class="outline-3">
<h3 id="headline-9">
Derivadas, gradientes e gradiente descendente
</h3>
<div id="outline-text-headline-9" class="outline-text-3">
<p>
A derivada mede a taxa de variação instantânea: se <code>f(x) = x²</code>, então <code>f&#39;(x) = 2x</code>. Em <code>x = 3</code>, a derivada é 6: um passo infinitesimal pra direita aumenta a função 6 vezes mais rápido. O gradiente é a derivada pra funções de múltiplas variáveis: um vetor que aponta na direção de maior crescimento. O gradiente descendente anda na direção oposta (a de maior <em>decrescimento</em>).</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">numpy</span> <span class="k">as</span> <span class="nn">np</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">gradiente_descendente</span><span class="p">(</span><span class="n">f_grad</span><span class="p">,</span> <span class="n">x0</span><span class="p">,</span> <span class="n">lr</span><span class="o">=</span><span class="mf">0.01</span><span class="p">,</span> <span class="n">steps</span><span class="o">=</span><span class="mi">100</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="n">x</span> <span class="o">=</span> <span class="n">x0</span><span class="o">.</span><span class="n">copy</span><span class="p">()</span>
</span></span><span class="line"><span class="cl">    <span class="k">for</span> <span class="n">_</span> <span class="ow">in</span> <span class="nb">range</span><span class="p">(</span><span class="n">steps</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">        <span class="n">x</span> <span class="o">-=</span> <span class="n">lr</span> <span class="o">*</span> <span class="n">f_grad</span><span class="p">(</span><span class="n">x</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="n">x</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Minimizar f(x,y) = x² + y²</span>
</span></span><span class="line"><span class="cl"><span class="n">f_grad</span> <span class="o">=</span> <span class="k">lambda</span> <span class="n">x</span><span class="p">:</span> <span class="mi">2</span> <span class="o">*</span> <span class="n">x</span>
</span></span><span class="line"><span class="cl"><span class="n">minimo</span> <span class="o">=</span> <span class="n">gradiente_descendente</span><span class="p">(</span><span class="n">f_grad</span><span class="p">,</span> <span class="n">np</span><span class="o">.</span><span class="n">array</span><span class="p">([</span><span class="mf">5.0</span><span class="p">,</span> <span class="mf">5.0</span><span class="p">]))</span>
</span></span><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="n">minimo</span><span class="p">)</span>  <span class="c1"># [~0, ~0]</span></span></span></code></pre></div>
</div>
</div>
</div>
