blog/content/post/ai-math-foundations.org
** A regra da cadeia e a retropropagação

Quando você tem funções compostas ~f(g(h(x)))~, a derivada é o produto das derivadas de cada camada: ~f'(g(h(x))) * g'(h(x)) * h'(x)~. Isso é a regra da cadeia.

Redes neurais são composições gigantes de funções. A retropropagação (backprop) aplica a regra da cadeia da saída pra entrada, calculando o gradiente de cada peso em relação à loss. O PyTorch faz isso automaticamente com o grafo computacional: cada operação (~+~, ~*~, ~matmul~) registra como desfazê-la, e o ~.backward()~ percorre o grafo de trás pra frente.

A ideia central: /forward mode/ calcula derivadas da entrada pra saída (bom pra funções com poucas entradas e muitas saídas). /Reverse mode/ calcula da saída pra entrada (bom pra muitas entradas e uma saída, exatamente o caso de uma rede neural com milhões de parâmetros e uma loss escalar). PyTorch, JAX e TensorFlow usam reverse mode.

#+BEGIN_SRC python
import torch

x = torch.tensor([2.0], requires_grad=True)
y = x**3 + 2*x**2 + x  # f(x) = x³ + 2x² + x
y.backward()
print(x.grad)  # 3*4 + 4*2 + 1 = 21, a derivada em x=2
#+END_SRC

** Otimizadores: SGD, Momentum, Adam

O gradiente descendente puro (SGD) é ~w = w - lr * grad~. Funciona, mas é lento e fica preso em saddle points. Momentum adiciona inércia: ~v = β*v + grad; w = w - lr*v~. O acúmulo de velocidade ajuda a atravessar platôs.

Adam (Adaptive Moment Estimation) é o padrão da indústria. Ele mantém duas médias móveis: uma do gradiente (~m~, "momentum") e uma do gradiente ao quadrado (~v~, "escala adaptativa"). Cada parâmetro ganha sua própria taxa de aprendizado efetiva. Isso faz o Adam ser robusto a escalas diferentes dos gradientes (comum quando uma camada tem pesos 1000x maiores que outra).

#+BEGIN_SRC python
import numpy as np

class Adam:
    def __init__(self, lr=0.001, beta1=0.9, beta2=0.999, eps=1e-8):
        self.lr, self.b1, self.b2, self.eps = lr, beta1, beta2, eps
        self.m, self.v, self.t = None, None, 0

    def step(self, w, grad):
        if self.m is None:
            self.m = np.zeros_like(w)
            self.v = np.zeros_like(w)
        self.t += 1
        self.m = self.b1 * self.m + (1 - self.b1) * grad
        self.v = self.b2 * self.v + (1 - self.b2) * grad**2
        m_hat = self.m / (1 - self.b1**self.t)
        v_hat = self.v / (1 - self.b2**self.t)
        return w - self.lr * m_hat / (np.sqrt(v_hat) + self.eps)
#+END_SRC

** Otimização convexa e por que redes neurais funcionam mesmo sem ser

Uma função convexa tem um único mínimo global (pense numa tigela). Regressão linear, regressão logística e SVMs são convexos. Isso significa que o gradiente descendente /sempre/ converge pro melhor resultado possível, devagar ou rápido.

Redes neurais não são convexas. A superfície de loss tem milhares de mínimos locais e saddle points. Então por que funcionam? Dois motivos: (1) em altas dimensões, a maioria dos pontos críticos são saddle points (onde o gradiente é zero mas não é mínimo), não mínimos locais; (2) redes superparametrizadas (mais parâmetros que dados) tendem a ter paisagens de loss mais "suaves", com muitos mínimos de qualidade similar. Na prática, o Adam acha um deles e a validação confirma se é bom.

Multiplicadores de Lagrange e condições KKT são a teoria por trás de restrições: L1/L2 podem ser vistas como "minimize a loss, mas mantenha os pesos dentro de uma bola de raio R". É assim que SVMs derivam o kernel trick via formulação dual.

#+BEGIN_QUOTE
/Em miúdos:/ ~Gradiente~ é a seta que aponta pro topo do morro; você anda no sentido contrário pra descer. ~Learning rate~ é o tamanho do passo: grande demais, você pula o vale; pequeno demais, não sai do lugar. ~Momentum~ é inércia: continue andando na direção que você já estava, mesmo que o chão esteja plano. ~Convexidade~ é garantia de que não tem vale falso: toda descida leva ao fundo de verdade. ~Saddle point~ é um ponto plano que não é mínimo nem máximo: o gradiente é zero, mas você não está no fundo e precisa de momentum pra escapar.
#+END_QUOTE

