ai-math-foundations/index.html
<div id="outline-container-headline-10" class="outline-3">
<h3 id="headline-10">
A regra da cadeia e a retropropagação
</h3>
<div id="outline-text-headline-10" class="outline-text-3">
<p>
Quando você tem funções compostas <code>f(g(h(x)))</code>, a derivada é o produto das derivadas de cada camada: <code>f&#39;(g(h(x))) * g&#39;(h(x)) * h&#39;(x)</code>. Isso é a regra da cadeia.</p>
<p>
Redes neurais são composições gigantes de funções. A retropropagação (backprop) aplica a regra da cadeia da saída pra entrada, calculando o gradiente de cada peso em relação à loss. O PyTorch faz isso automaticamente com o grafo computacional: cada operação (<code>+</code>, <code>*</code>, <code>matmul</code>) registra como desfazê-la, e o <code>.backward()</code> percorre o grafo de trás pra frente.</p>
<p>
A ideia central: <em>forward mode</em> calcula derivadas da entrada pra saída (bom pra funções com poucas entradas e muitas saídas). <em>Reverse mode</em> calcula da saída pra entrada (bom pra muitas entradas e uma saída, exatamente o caso de uma rede neural com milhões de parâmetros e uma loss escalar). PyTorch, JAX e TensorFlow usam reverse mode.</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">torch</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="n">x</span> <span class="o">=</span> <span class="n">torch</span><span class="o">.</span><span class="n">tensor</span><span class="p">([</span><span class="mf">2.0</span><span class="p">],</span> <span class="n">requires_grad</span><span class="o">=</span><span class="kc">True</span><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="n">y</span> <span class="o">=</span> <span class="n">x</span><span class="o">**</span><span class="mi">3</span> <span class="o">+</span> <span class="mi">2</span><span class="o">*</span><span class="n">x</span><span class="o">**</span><span class="mi">2</span> <span class="o">+</span> <span class="n">x</span>  <span class="c1"># f(x) = x³ + 2x² + x</span>
</span></span><span class="line"><span class="cl"><span class="n">y</span><span class="o">.</span><span class="n">backward</span><span class="p">()</span>
</span></span><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="n">x</span><span class="o">.</span><span class="n">grad</span><span class="p">)</span>  <span class="c1"># 3*4 + 4*2 + 1 = 21, a derivada em x=2</span></span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-11" class="outline-3">
<h3 id="headline-11">
Otimizadores: SGD, Momentum, Adam
</h3>
<div id="outline-text-headline-11" class="outline-text-3">
<p>
O gradiente descendente puro (SGD) é <code>w = w - lr * grad</code>. Funciona, mas é lento e fica preso em saddle points. Momentum adiciona inércia: <code>v = β*v + grad; w = w - lr*v</code>. O acúmulo de velocidade ajuda a atravessar platôs.</p>
<p>
Adam (Adaptive Moment Estimation) é o padrão da indústria. Ele mantém duas médias móveis: uma do gradiente (<code>m</code>, &#34;momentum&#34;) e uma do gradiente ao quadrado (<code>v</code>, &#34;escala adaptativa&#34;). Cada parâmetro ganha sua própria taxa de aprendizado efetiva. Isso faz o Adam ser robusto a escalas diferentes dos gradientes (comum quando uma camada tem pesos 1000x maiores que outra).</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">numpy</span> <span class="k">as</span> <span class="nn">np</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="k">class</span> <span class="nc">Adam</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">lr</span><span class="o">=</span><span class="mf">0.001</span><span class="p">,</span> <span class="n">beta1</span><span class="o">=</span><span class="mf">0.9</span><span class="p">,</span> <span class="n">beta2</span><span class="o">=</span><span class="mf">0.999</span><span class="p">,</span> <span class="n">eps</span><span class="o">=</span><span class="mf">1e-8</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">        <span class="bp">self</span><span class="o">.</span><span class="n">lr</span><span class="p">,</span> <span class="bp">self</span><span class="o">.</span><span class="n">b1</span><span class="p">,</span> <span class="bp">self</span><span class="o">.</span><span class="n">b2</span><span class="p">,</span> <span class="bp">self</span><span class="o">.</span><span class="n">eps</span> <span class="o">=</span> <span class="n">lr</span><span class="p">,</span> <span class="n">beta1</span><span class="p">,</span> <span class="n">beta2</span><span class="p">,</span> <span class="n">eps</span>
</span></span><span class="line"><span class="cl">        <span class="bp">self</span><span class="o">.</span><span class="n">m</span><span class="p">,</span> <span class="bp">self</span><span class="o">.</span><span class="n">v</span><span class="p">,</span> <span class="bp">self</span><span class="o">.</span><span class="n">t</span> <span class="o">=</span> <span class="kc">None</span><span class="p">,</span> <span class="kc">None</span><span class="p">,</span> <span class="mi">0</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">    <span class="k">def</span> <span class="nf">step</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">w</span><span class="p">,</span> <span class="n">grad</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">        <span class="k">if</span> <span class="bp">self</span><span class="o">.</span><span class="n">m</span> <span class="ow">is</span> <span class="kc">None</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">            <span class="bp">self</span><span class="o">.</span><span class="n">m</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">zeros_like</span><span class="p">(</span><span class="n">w</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">            <span class="bp">self</span><span class="o">.</span><span class="n">v</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">zeros_like</span><span class="p">(</span><span class="n">w</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="bp">self</span><span class="o">.</span><span class="n">t</span> <span class="o">+=</span> <span class="mi">1</span>
</span></span><span class="line"><span class="cl">        <span class="bp">self</span><span class="o">.</span><span class="n">m</span> <span class="o">=</span> <span class="bp">self</span><span class="o">.</span><span class="n">b1</span> <span class="o">*</span> <span class="bp">self</span><span class="o">.</span><span class="n">m</span> <span class="o">+</span> <span class="p">(</span><span class="mi">1</span> <span class="o">-</span> <span class="bp">self</span><span class="o">.</span><span class="n">b1</span><span class="p">)</span> <span class="o">*</span> <span class="n">grad</span>
</span></span><span class="line"><span class="cl">        <span class="bp">self</span><span class="o">.</span><span class="n">v</span> <span class="o">=</span> <span class="bp">self</span><span class="o">.</span><span class="n">b2</span> <span class="o">*</span> <span class="bp">self</span><span class="o">.</span><span class="n">v</span> <span class="o">+</span> <span class="p">(</span><span class="mi">1</span> <span class="o">-</span> <span class="bp">self</span><span class="o">.</span><span class="n">b2</span><span class="p">)</span> <span class="o">*</span> <span class="n">grad</span><span class="o">**</span><span class="mi">2</span>
</span></span><span class="line"><span class="cl">        <span class="n">m_hat</span> <span class="o">=</span> <span class="bp">self</span><span class="o">.</span><span class="n">m</span> <span class="o">/</span> <span class="p">(</span><span class="mi">1</span> <span class="o">-</span> <span class="bp">self</span><span class="o">.</span><span class="n">b1</span><span class="o">**</span><span class="bp">self</span><span class="o">.</span><span class="n">t</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="n">v_hat</span> <span class="o">=</span> <span class="bp">self</span><span class="o">.</span><span class="n">v</span> <span class="o">/</span> <span class="p">(</span><span class="mi">1</span> <span class="o">-</span> <span class="bp">self</span><span class="o">.</span><span class="n">b2</span><span class="o">**</span><span class="bp">self</span><span class="o">.</span><span class="n">t</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="k">return</span> <span class="n">w</span> <span class="o">-</span> <span class="bp">self</span><span class="o">.</span><span class="n">lr</span> <span class="o">*</span> <span class="n">m_hat</span> <span class="o">/</span> <span class="p">(</span><span class="n">np</span><span class="o">.</span><span class="n">sqrt</span><span class="p">(</span><span class="n">v_hat</span><span class="p">)</span> <span class="o">+</span> <span class="bp">self</span><span class="o">.</span><span class="n">eps</span><span class="p">)</span></span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-12" class="outline-3">
<h3 id="headline-12">
Otimização convexa e por que redes neurais funcionam mesmo sem ser
</h3>
<div id="outline-text-headline-12" class="outline-text-3">
<p>
Uma função convexa tem um único mínimo global (pense numa tigela). Regressão linear, regressão logística e SVMs são convexos. Isso significa que o gradiente descendente <em>sempre</em> converge pro melhor resultado possível, devagar ou rápido.</p>
<p>
Redes neurais não são convexas. A superfície de loss tem milhares de mínimos locais e saddle points. Então por que funcionam? Dois motivos: (1) em altas dimensões, a maioria dos pontos críticos são saddle points (onde o gradiente é zero mas não é mínimo), não mínimos locais; (2) redes superparametrizadas (mais parâmetros que dados) tendem a ter paisagens de loss mais &#34;suaves&#34;, com muitos mínimos de qualidade similar. Na prática, o Adam acha um deles e a validação confirma se é bom.</p>
<p>
Multiplicadores de Lagrange e condições KKT são a teoria por trás de restrições: L1/L2 podem ser vistas como &#34;minimize a loss, mas mantenha os pesos dentro de uma bola de raio R&#34;. É assim que SVMs derivam o kernel trick via formulação dual.</p>
<blockquote>
<p><em>Em miúdos:</em> <code>Gradiente</code> é a seta que aponta pro topo do morro; você anda no sentido contrário pra descer. <code>Learning rate</code> é o tamanho do passo: grande demais, você pula o vale; pequeno demais, não sai do lugar. <code>Momentum</code> é inércia: continue andando na direção que você já estava, mesmo que o chão esteja plano. <code>Convexidade</code> é garantia de que não tem vale falso: toda descida leva ao fundo de verdade. <code>Saddle point</code> é um ponto plano que não é mínimo nem máximo: o gradiente é zero, mas você não está no fundo e precisa de momentum pra escapar.</p>
</blockquote>
</div>
</div>
</div>
</div>
