blog/content/post/ai-math-foundations.org
* Probabilidade e estatística: como a IA lida com incerteza

Modelos de IA fazem previsões, e previsões são probabilidades. "Este pixel é um gato com 87% de confiança". "A próxima palavra provável é 'cachorro' com probabilidade 0.23". Toda essa confiança é modelada com probabilidade.

** Distribuições, esperança e entropia

Uma distribuição de probabilidade descreve quão provável cada resultado é. A normal (Gaussiana) reina na natureza e nos pesos iniciais de redes neurais (inicialização de Kaiming/He). A categórica reina nas saídas de classificação.

A /entropia/ mede incerteza: ~H(P) = -Σ p(x) log(p(x))~. Uma moeda justa (50/50) tem entropia máxima. Uma moeda viciada (100/0) tem entropia zero. A entropia cruzada ~H(P, Q)~ mede quão bem a distribuição Q aproxima a verdadeira P. E é exatamente isso que a loss de classificação minimiza: ~CrossEntropy(y_true, y_pred)~.

A /divergência KL/ mede a diferença entre duas distribuições: ~KL(P||Q) = H(P,Q) - H(P)~. É usada em VAEs (Variational Autoencoders: aproxime a distribuição latente da normal), RLHF (alinhar o modelo com preferências humanas) e compressão de modelos.

#+BEGIN_SRC python
import numpy as np

def entropia(p):
    p = p[p > 0]
    return -np.sum(p * np.log2(p))

def entropia_cruzada(p, q):
    q = np.clip(q, 1e-12, 1.0)
    return -np.sum(p * np.log(q))

# Moeda justa vs viciada
p_justa = np.array([0.5, 0.5])
p_viciada = np.array([0.9, 0.1])
print(entropia(p_justa))    # 1.0 bit
print(entropia(p_viciada))  # 0.47 bits
print(entropia_cruzada(p_justa, p_viciada))  # alto = predição ruim
#+END_SRC

** Bayes: o teorema que atualiza crenças

O teorema de Bayes diz como atualizar o que você acredita quando aparece evidência nova: ~P(A|B) = P(B|A) * P(A) / P(B)~. O ~P(A)~ é o prior (o que você acreditava antes). O ~P(B|A)~ é a verossimilhança (quão bem a evidência se encaixa na sua crença). O ~P(A|B)~ é o posterior (sua crença atualizada).

Naive Bayes é o classificador mais simples que existe. Apesar do pressuposto ingênuo de independência entre features ("a palavra 'grátis' não tem nada a ver com 'dinheiro'"), ele funciona surpreendentemente bem pra classificação de texto e spam.

Na prática de deep learning, Bayes aparece discretamente: regularização L2 é equivalente a um prior Gaussiano nos pesos (MAP, Maximum A Posteriori). Dropout é uma aproximação Bayesiana (MC Dropout). O aprendizado online é literalmente atualização Bayesiana sequencial.

#+BEGIN_SRC python
import numpy as np

class NaiveBayes:
    def fit(self, X, y, n_classes):
        self.prior = np.bincount(y) / len(y)
        self.likelihood = np.zeros((n_classes, X.shape[1]))
        for c in range(n_classes):
            X_c = X[y == c]
            self.likelihood[c] = (X_c.sum(axis=0) + 1) / (X_c.sum() + X.shape[1])

    def predict(self, X):
        log_posterior = X @ np.log(self.likelihood.T) + np.log(self.prior)
        return np.argmax(log_posterior, axis=1)
#+END_SRC

