ai-math-foundations/index.html
<div id="outline-container-headline-13" class="outline-2">
<h2 id="headline-13">
Probabilidade e estatística: como a IA lida com incerteza
</h2>
<div id="outline-text-headline-13" class="outline-text-2">
<p>
Modelos de IA fazem previsões, e previsões são probabilidades. &#34;Este pixel é um gato com 87% de confiança&#34;. &#34;A próxima palavra provável é &#39;cachorro&#39; com probabilidade 0.23&#34;. Toda essa confiança é modelada com probabilidade.</p>
<div id="outline-container-headline-14" class="outline-3">
<h3 id="headline-14">
Distribuições, esperança e entropia
</h3>
<div id="outline-text-headline-14" class="outline-text-3">
<p>
Uma distribuição de probabilidade descreve quão provável cada resultado é. A normal (Gaussiana) reina na natureza e nos pesos iniciais de redes neurais (inicialização de Kaiming/He). A categórica reina nas saídas de classificação.</p>
<p>
A <em>entropia</em> mede incerteza: <code>H(P) = -Σ p(x) log(p(x))</code>. Uma moeda justa (50/50) tem entropia máxima. Uma moeda viciada (100/0) tem entropia zero. A entropia cruzada <code>H(P, Q)</code> mede quão bem a distribuição Q aproxima a verdadeira P. E é exatamente isso que a loss de classificação minimiza: <code>CrossEntropy(y_true, y_pred)</code>.</p>
<p>
A <em>divergência KL</em> mede a diferença entre duas distribuições: <code>KL(P||Q) = H(P,Q) - H(P)</code>. É usada em VAEs (Variational Autoencoders: aproxime a distribuição latente da normal), RLHF (alinhar o modelo com preferências humanas) e compressão de modelos.</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">numpy</span> <span class="k">as</span> <span class="nn">np</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">entropia</span><span class="p">(</span><span class="n">p</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="n">p</span> <span class="o">=</span> <span class="n">p</span><span class="p">[</span><span class="n">p</span> <span class="o">&gt;</span> <span class="mi">0</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="o">-</span><span class="n">np</span><span class="o">.</span><span class="n">sum</span><span class="p">(</span><span class="n">p</span> <span class="o">*</span> <span class="n">np</span><span class="o">.</span><span class="n">log2</span><span class="p">(</span><span class="n">p</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">entropia_cruzada</span><span class="p">(</span><span class="n">p</span><span class="p">,</span> <span class="n">q</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="n">q</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">clip</span><span class="p">(</span><span class="n">q</span><span class="p">,</span> <span class="mf">1e-12</span><span class="p">,</span> <span class="mf">1.0</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="o">-</span><span class="n">np</span><span class="o">.</span><span class="n">sum</span><span class="p">(</span><span class="n">p</span> <span class="o">*</span> <span class="n">np</span><span class="o">.</span><span class="n">log</span><span class="p">(</span><span class="n">q</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Moeda justa vs viciada</span>
</span></span><span class="line"><span class="cl"><span class="n">p_justa</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">array</span><span class="p">([</span><span class="mf">0.5</span><span class="p">,</span> <span class="mf">0.5</span><span class="p">])</span>
</span></span><span class="line"><span class="cl"><span class="n">p_viciada</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">array</span><span class="p">([</span><span class="mf">0.9</span><span class="p">,</span> <span class="mf">0.1</span><span class="p">])</span>
</span></span><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="n">entropia</span><span class="p">(</span><span class="n">p_justa</span><span class="p">))</span>    <span class="c1"># 1.0 bit</span>
</span></span><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="n">entropia</span><span class="p">(</span><span class="n">p_viciada</span><span class="p">))</span>  <span class="c1"># 0.47 bits</span>
</span></span><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="n">entropia_cruzada</span><span class="p">(</span><span class="n">p_justa</span><span class="p">,</span> <span class="n">p_viciada</span><span class="p">))</span>  <span class="c1"># alto = predição ruim</span></span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-15" class="outline-3">
<h3 id="headline-15">
Bayes: o teorema que atualiza crenças
</h3>
<div id="outline-text-headline-15" class="outline-text-3">
<p>
O teorema de Bayes diz como atualizar o que você acredita quando aparece evidência nova: <code>P(A|B) = P(B|A) * P(A) / P(B)</code>. O <code>P(A)</code> é o prior (o que você acreditava antes). O <code>P(B|A)</code> é a verossimilhança (quão bem a evidência se encaixa na sua crença). O <code>P(A|B)</code> é o posterior (sua crença atualizada).</p>
<p>
Naive Bayes é o classificador mais simples que existe. Apesar do pressuposto ingênuo de independência entre features (&#34;a palavra &#39;grátis&#39; não tem nada a ver com &#39;dinheiro&#39;&#34;), ele funciona surpreendentemente bem pra classificação de texto e spam.</p>
<p>
Na prática de deep learning, Bayes aparece discretamente: regularização L2 é equivalente a um prior Gaussiano nos pesos (MAP, Maximum A Posteriori). Dropout é uma aproximação Bayesiana (MC Dropout). O aprendizado online é literalmente atualização Bayesiana sequencial.</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">numpy</span> <span class="k">as</span> <span class="nn">np</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="k">class</span> <span class="nc">NaiveBayes</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">    <span class="k">def</span> <span class="nf">fit</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">X</span><span class="p">,</span> <span class="n">y</span><span class="p">,</span> <span class="n">n_classes</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">        <span class="bp">self</span><span class="o">.</span><span class="n">prior</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">bincount</span><span class="p">(</span><span class="n">y</span><span class="p">)</span> <span class="o">/</span> <span class="nb">len</span><span class="p">(</span><span class="n">y</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="bp">self</span><span class="o">.</span><span class="n">likelihood</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">zeros</span><span class="p">((</span><span class="n">n_classes</span><span class="p">,</span> <span class="n">X</span><span class="o">.</span><span class="n">shape</span><span class="p">[</span><span class="mi">1</span><span class="p">]))</span>
</span></span><span class="line"><span class="cl">        <span class="k">for</span> <span class="n">c</span> <span class="ow">in</span> <span class="nb">range</span><span class="p">(</span><span class="n">n_classes</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">            <span class="n">X_c</span> <span class="o">=</span> <span class="n">X</span><span class="p">[</span><span class="n">y</span> <span class="o">==</span> <span class="n">c</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">            <span class="bp">self</span><span class="o">.</span><span class="n">likelihood</span><span class="p">[</span><span class="n">c</span><span class="p">]</span> <span class="o">=</span> <span class="p">(</span><span class="n">X_c</span><span class="o">.</span><span class="n">sum</span><span class="p">(</span><span class="n">axis</span><span class="o">=</span><span class="mi">0</span><span class="p">)</span> <span class="o">+</span> <span class="mi">1</span><span class="p">)</span> <span class="o">/</span> <span class="p">(</span><span class="n">X_c</span><span class="o">.</span><span class="n">sum</span><span class="p">()</span> <span class="o">+</span> <span class="n">X</span><span class="o">.</span><span class="n">shape</span><span class="p">[</span><span class="mi">1</span><span class="p">])</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">    <span class="k">def</span> <span class="nf">predict</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">X</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">        <span class="n">log_posterior</span> <span class="o">=</span> <span class="n">X</span> <span class="o">@</span> <span class="n">np</span><span class="o">.</span><span class="n">log</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">likelihood</span><span class="o">.</span><span class="n">T</span><span class="p">)</span> <span class="o">+</span> <span class="n">np</span><span class="o">.</span><span class="n">log</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">prior</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="k">return</span> <span class="n">np</span><span class="o">.</span><span class="n">argmax</span><span class="p">(</span><span class="n">log_posterior</span><span class="p">,</span> <span class="n">axis</span><span class="o">=</span><span class="mi">1</span><span class="p">)</span></span></span></code></pre></div>
</div>
</div>
</div>
