blog/content/post/ai-math-foundations.org
** Estatística pra ML: como saber se seu modelo presta

Acurácia sozinha engana. Se 99% dos seus dados são da classe A, um modelo que sempre chuta A tem 99% de acurácia e zero utilidade. Você precisa de mais.

O /teste t pareado/ compara dois modelos nos mesmos folds de validação cruzada: o modelo A é significativamente melhor que o B ou foi sorte? O /bootstrap/ reconstrói o intervalo de confiança de qualquer métrica reamostrando os dados com reposição. O /tamanho de efeito/ (Cohen's d) mede a magnitude da diferença, não só se ela existe: um modelo pode ser "significativamente" melhor com p < 0.001 mas a diferença prática ser irrelevante.

O Teorema Central do Limite (CLT) é o que faz tudo isso funcionar: médias de amostras tendem a uma distribuição normal conforme o tamanho da amostra cresce, independentemente da distribuição original. É por isso que o SGD funciona: o gradiente de um mini-batch é uma média, e o CLT diz que essa média é aproximadamente normal em torno do gradiente verdadeiro.

** Amostragem: como gerar dados sintéticos

Às vezes você precisa gerar amostras de uma distribuição complicada. A inversão da CDF resolve quando você conhece a cumulativa. Amostragem por rejeição resolve quando você conhece a densidade e pode envolvê-la numa distribuição mais simples.

MCMC (Markov Chain Monte Carlo) resolve quando a distribuição é complexa demais pra qualquer envelope simples. O Metropolis-Hastings propõe um passo aleatório e aceita ou rejeita baseado em quão melhor o novo ponto é. O Gibbs faz isso coordenada por coordenada. São a base da inferência Bayesiana moderna.

E as técnicas de amostragem são o coração dos LLMs: /temperature/ achata ou afia a distribuição de probabilidade (T > 1 = mais criativo, T < 1 = mais determinístico). /top-k/ restringe às k palavras mais prováveis. /top-p/ (nucleus sampling) acumula probabilidade até bater um limiar. O /reparameterization trick/ (z = μ + σ·ε) faz sampling diferenciável, o que torna VAEs treináveis. E /diffusion models/ são literalmente cadeias de amostragem iterativa: parta do ruído puro e vá removendo ruído passo a passo guiado por uma rede neural.

#+BEGIN_SRC python
import numpy as np

def temperatura(logits, T=1.0):
    probs = np.exp(logits / T)
    return probs / probs.sum()

def top_k(logits, k=10):
    indices = np.argpartition(logits, -k)[-k:]
    mask = np.ones_like(logits) * -np.inf
    mask[indices] = logits[indices]
    probs = np.exp(mask - mask.max())
    return probs / probs.sum()

logits = np.array([0.1, 0.5, 2.0, 0.3, 1.5])

print("T=1.0:", temperatura(logits, 1.0))  # normal
print("T=0.5:", temperatura(logits, 0.5))  # mais determinístico
print("T=2.0:", temperatura(logits, 2.0))  # mais criativo
print("top-3:", top_k(logits, 3))
#+END_SRC

** Processos estocásticos

Um processo estocástico é uma sequência de variáveis aleatórias indexadas no tempo. O mais simples é o passeio aleatório: a cada passo, jogue uma moeda e ande pra esquerda ou direita. A distância esperada depois de ~n~ passos é ~√n~ (não ~n~, porque os passos se cancelam parcialmente).

Cadeias de Markov são processos onde o próximo estado só depende do atual (não de toda a história). A geração de tokens em LLMs é uma cadeia de Markov: cada token é amostrado condicionado no contexto da janela, e o próximo depende do que foi gerado. O movimento browniano (versão contínua do passeio aleatório) é a base matemática dos modelos de difusão.

#+BEGIN_SRC python
import numpy as np

def random_walk(steps=1000):
    pos = np.cumsum(np.random.choice([-1, 1], size=steps))
    return np.sqrt(np.mean(pos**2))  # deve ser ~sqrt(steps)

print(f"Distância esperada: ~{np.sqrt(1000):.1f}")
print(f"Distância observada: ~{random_walk():.1f}")
#+END_SRC

* Tópicos aplicados: o que conecta a teoria ao treino real

Os três blocos anteriores cobrem a espinha dorsal. O último bloco cobre ferramentas matemáticas que aparecem em situações específicas de treino e inferência.

