ai-math-foundations/index.html
<div id="outline-container-headline-16" class="outline-3">
<h3 id="headline-16">
Estatística pra ML: como saber se seu modelo presta
</h3>
<div id="outline-text-headline-16" class="outline-text-3">
<p>
Acurácia sozinha engana. Se 99% dos seus dados são da classe A, um modelo que sempre chuta A tem 99% de acurácia e zero utilidade. Você precisa de mais.</p>
<p>
O <em>teste t pareado</em> compara dois modelos nos mesmos folds de validação cruzada: o modelo A é significativamente melhor que o B ou foi sorte? O <em>bootstrap</em> reconstrói o intervalo de confiança de qualquer métrica reamostrando os dados com reposição. O <em>tamanho de efeito</em> (Cohen&#39;s d) mede a magnitude da diferença, não só se ela existe: um modelo pode ser &#34;significativamente&#34; melhor com p &lt; 0.001 mas a diferença prática ser irrelevante.</p>
<p>
O Teorema Central do Limite (CLT) é o que faz tudo isso funcionar: médias de amostras tendem a uma distribuição normal conforme o tamanho da amostra cresce, independentemente da distribuição original. É por isso que o SGD funciona: o gradiente de um mini-batch é uma média, e o CLT diz que essa média é aproximadamente normal em torno do gradiente verdadeiro.</p>
</div>
</div>
<div id="outline-container-headline-17" class="outline-3">
<h3 id="headline-17">
Amostragem: como gerar dados sintéticos
</h3>
<div id="outline-text-headline-17" class="outline-text-3">
<p>
Às vezes você precisa gerar amostras de uma distribuição complicada. A inversão da CDF resolve quando você conhece a cumulativa. Amostragem por rejeição resolve quando você conhece a densidade e pode envolvê-la numa distribuição mais simples.</p>
<p>
MCMC (Markov Chain Monte Carlo) resolve quando a distribuição é complexa demais pra qualquer envelope simples. O Metropolis-Hastings propõe um passo aleatório e aceita ou rejeita baseado em quão melhor o novo ponto é. O Gibbs faz isso coordenada por coordenada. São a base da inferência Bayesiana moderna.</p>
<p>
E as técnicas de amostragem são o coração dos LLMs: <em>temperature</em> achata ou afia a distribuição de probabilidade (T &gt; 1 = mais criativo, T &lt; 1 = mais determinístico). <em>top-k</em> restringe às k palavras mais prováveis. <em>top-p</em> (nucleus sampling) acumula probabilidade até bater um limiar. O <em>reparameterization trick</em> (z = μ + σ·ε) faz sampling diferenciável, o que torna VAEs treináveis. E <em>diffusion models</em> são literalmente cadeias de amostragem iterativa: parta do ruído puro e vá removendo ruído passo a passo guiado por uma rede neural.</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">numpy</span> <span class="k">as</span> <span class="nn">np</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">temperatura</span><span class="p">(</span><span class="n">logits</span><span class="p">,</span> <span class="n">T</span><span class="o">=</span><span class="mf">1.0</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="n">probs</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">exp</span><span class="p">(</span><span class="n">logits</span> <span class="o">/</span> <span class="n">T</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="n">probs</span> <span class="o">/</span> <span class="n">probs</span><span class="o">.</span><span class="n">sum</span><span class="p">()</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">top_k</span><span class="p">(</span><span class="n">logits</span><span class="p">,</span> <span class="n">k</span><span class="o">=</span><span class="mi">10</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="n">indices</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">argpartition</span><span class="p">(</span><span class="n">logits</span><span class="p">,</span> <span class="o">-</span><span class="n">k</span><span class="p">)[</span><span class="o">-</span><span class="n">k</span><span class="p">:]</span>
</span></span><span class="line"><span class="cl">    <span class="n">mask</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">ones_like</span><span class="p">(</span><span class="n">logits</span><span class="p">)</span> <span class="o">*</span> <span class="o">-</span><span class="n">np</span><span class="o">.</span><span class="n">inf</span>
</span></span><span class="line"><span class="cl">    <span class="n">mask</span><span class="p">[</span><span class="n">indices</span><span class="p">]</span> <span class="o">=</span> <span class="n">logits</span><span class="p">[</span><span class="n">indices</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">    <span class="n">probs</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">exp</span><span class="p">(</span><span class="n">mask</span> <span class="o">-</span> <span class="n">mask</span><span class="o">.</span><span class="n">max</span><span class="p">())</span>
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="n">probs</span> <span class="o">/</span> <span class="n">probs</span><span class="o">.</span><span class="n">sum</span><span class="p">()</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="n">logits</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">array</span><span class="p">([</span><span class="mf">0.1</span><span class="p">,</span> <span class="mf">0.5</span><span class="p">,</span> <span class="mf">2.0</span><span class="p">,</span> <span class="mf">0.3</span><span class="p">,</span> <span class="mf">1.5</span><span class="p">])</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="s2">&#34;T=1.0:&#34;</span><span class="p">,</span> <span class="n">temperatura</span><span class="p">(</span><span class="n">logits</span><span class="p">,</span> <span class="mf">1.0</span><span class="p">))</span>  <span class="c1"># normal</span>
</span></span><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="s2">&#34;T=0.5:&#34;</span><span class="p">,</span> <span class="n">temperatura</span><span class="p">(</span><span class="n">logits</span><span class="p">,</span> <span class="mf">0.5</span><span class="p">))</span>  <span class="c1"># mais determinístico</span>
</span></span><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="s2">&#34;T=2.0:&#34;</span><span class="p">,</span> <span class="n">temperatura</span><span class="p">(</span><span class="n">logits</span><span class="p">,</span> <span class="mf">2.0</span><span class="p">))</span>  <span class="c1"># mais criativo</span>
</span></span><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="s2">&#34;top-3:&#34;</span><span class="p">,</span> <span class="n">top_k</span><span class="p">(</span><span class="n">logits</span><span class="p">,</span> <span class="mi">3</span><span class="p">))</span></span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-18" class="outline-3">
<h3 id="headline-18">
Processos estocásticos
</h3>
<div id="outline-text-headline-18" class="outline-text-3">
<p>
Um processo estocástico é uma sequência de variáveis aleatórias indexadas no tempo. O mais simples é o passeio aleatório: a cada passo, jogue uma moeda e ande pra esquerda ou direita. A distância esperada depois de <code>n</code> passos é <code>√n</code> (não <code>n</code>, porque os passos se cancelam parcialmente).</p>
<p>
Cadeias de Markov são processos onde o próximo estado só depende do atual (não de toda a história). A geração de tokens em LLMs é uma cadeia de Markov: cada token é amostrado condicionado no contexto da janela, e o próximo depende do que foi gerado. O movimento browniano (versão contínua do passeio aleatório) é a base matemática dos modelos de difusão.</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">numpy</span> <span class="k">as</span> <span class="nn">np</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">random_walk</span><span class="p">(</span><span class="n">steps</span><span class="o">=</span><span class="mi">1000</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="n">pos</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">cumsum</span><span class="p">(</span><span class="n">np</span><span class="o">.</span><span class="n">random</span><span class="o">.</span><span class="n">choice</span><span class="p">([</span><span class="o">-</span><span class="mi">1</span><span class="p">,</span> <span class="mi">1</span><span class="p">],</span> <span class="n">size</span><span class="o">=</span><span class="n">steps</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="n">np</span><span class="o">.</span><span class="n">sqrt</span><span class="p">(</span><span class="n">np</span><span class="o">.</span><span class="n">mean</span><span class="p">(</span><span class="n">pos</span><span class="o">**</span><span class="mi">2</span><span class="p">))</span>  <span class="c1"># deve ser ~sqrt(steps)</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="sa">f</span><span class="s2">&#34;Distância esperada: ~</span><span class="si">{</span><span class="n">np</span><span class="o">.</span><span class="n">sqrt</span><span class="p">(</span><span class="mi">1000</span><span class="p">)</span><span class="si">:</span><span class="s2">.1f</span><span class="si">}</span><span class="s2">&#34;</span><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="sa">f</span><span class="s2">&#34;Distância observada: ~</span><span class="si">{</span><span class="n">random_walk</span><span class="p">()</span><span class="si">:</span><span class="s2">.1f</span><span class="si">}</span><span class="s2">&#34;</span><span class="p">)</span></span></span></code></pre></div>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-19" class="outline-2">
<h2 id="headline-19">
Tópicos aplicados: o que conecta a teoria ao treino real
</h2>
<div id="outline-text-headline-19" class="outline-text-2">
<p>
Os três blocos anteriores cobrem a espinha dorsal. O último bloco cobre ferramentas matemáticas que aparecem em situações específicas de treino e inferência.</p>
