blog/content/post/ai-math-foundations.org
** Estabilidade numérica

Computadores representam números com precisão finita (float32, float16, bfloat16). Quando você soma números de magnitudes muito diferentes, os pequenos desaparecem (underflow). Quando multiplica números grandes, o resultado excede o representável (overflow). Quando subtrai números quase iguais, perde precisão (cancelamento catastrófico).

O log-sum-exp trick é a solução mais importante: ~log(Σ exp(x_i)) = max(x) + log(Σ exp(x_i - max(x)))~. Subtrair o máximo antes de exponenciar evita overflow. Toda ~CrossEntropyLoss~ do PyTorch faz isso internamente.

Mixed precision (AMP) treina com float16 nas operações pesadas (forward, backward) e float32 nas críticas (atualização de pesos). Acelera o treino sem perder qualidade. Bfloat16 é ainda melhor: mesma faixa do float32 (8 bits de expoente), menos precisão nos 7 bits de mantissa, mas o bastante pra gradientes.

#+BEGIN_SRC python
import numpy as np

def softmax_estavel(x):
    x_max = np.max(x)
    exp_x = np.exp(x - x_max)
    return exp_x / exp_x.sum()

def cross_entropy_estavel(logits, target):
    log_probs = logits - np.log(np.sum(np.exp(logits - logits.max())))
    return -log_probs[target]

x = np.array([1000, 1000, 1000])  # valores grandes
print(softmax_estavel(x))  # [0.33, 0.33, 0.33], correto e sem NaN
#+END_SRC

** Normas e distâncias

A distância entre dois vetores pode ser medida de vários jeitos, e a escolha muda tudo. Distância Euclidiana (L2) é a mais comum: hipotenusa, menor caminho. Distância Manhattan (L1) soma as diferenças absolutas: como andar em quarteirões. Distância Chebyshev (L∞) pega só a maior diferença entre coordenadas.

Similaridade de cosseno mede o ângulo, não a magnitude. É a métrica dominante em NLP e embeddings porque dois textos sobre o mesmo assunto têm vetores que apontam na mesma direção, mesmo que um seja muito mais longo que o outro (magnitudes diferentes). Todo banco vetorial (Qdrant, Pinecone, Weaviate) usa similaridade de cosseno como padrão.

A regularização L1 (LASSO) produz pesos esparsos: muitos pesos viram exatamente zero, o que é seleção automática de features. L2 (Ridge) encolhe todos os pesos proporcionalmente, o que é bom pra multicolinearidade.

#+BEGIN_SRC python
import numpy as np

a, b = np.array([1, 0]), np.array([0, 1])

print("L1:", np.sum(np.abs(a - b)))                 # 2 (Manhattan)
print("L2:", np.sqrt(np.sum((a - b)**2)))           # 1.414 (Euclidiana)
print("Cosseno:", 1 - np.dot(a,b)/(np.linalg.norm(a)*np.linalg.norm(b)))  # 1.0 (ortogonais)
#+END_SRC

