ai-math-foundations/index.html
<div id="outline-container-headline-20" class="outline-3">
<h3 id="headline-20">
Estabilidade numérica
</h3>
<div id="outline-text-headline-20" class="outline-text-3">
<p>
Computadores representam números com precisão finita (float32, float16, bfloat16). Quando você soma números de magnitudes muito diferentes, os pequenos desaparecem (underflow). Quando multiplica números grandes, o resultado excede o representável (overflow). Quando subtrai números quase iguais, perde precisão (cancelamento catastrófico).</p>
<p>
O log-sum-exp trick é a solução mais importante: <code>log(Σ exp(x_i)) = max(x) + log(Σ exp(x_i - max(x)))</code>. Subtrair o máximo antes de exponenciar evita overflow. Toda <code>CrossEntropyLoss</code> do PyTorch faz isso internamente.</p>
<p>
Mixed precision (AMP) treina com float16 nas operações pesadas (forward, backward) e float32 nas críticas (atualização de pesos). Acelera o treino sem perder qualidade. Bfloat16 é ainda melhor: mesma faixa do float32 (8 bits de expoente), menos precisão nos 7 bits de mantissa, mas o bastante pra gradientes.</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">numpy</span> <span class="k">as</span> <span class="nn">np</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">softmax_estavel</span><span class="p">(</span><span class="n">x</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="n">x_max</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">max</span><span class="p">(</span><span class="n">x</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="n">exp_x</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">exp</span><span class="p">(</span><span class="n">x</span> <span class="o">-</span> <span class="n">x_max</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="n">exp_x</span> <span class="o">/</span> <span class="n">exp_x</span><span class="o">.</span><span class="n">sum</span><span class="p">()</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">cross_entropy_estavel</span><span class="p">(</span><span class="n">logits</span><span class="p">,</span> <span class="n">target</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="n">log_probs</span> <span class="o">=</span> <span class="n">logits</span> <span class="o">-</span> <span class="n">np</span><span class="o">.</span><span class="n">log</span><span class="p">(</span><span class="n">np</span><span class="o">.</span><span class="n">sum</span><span class="p">(</span><span class="n">np</span><span class="o">.</span><span class="n">exp</span><span class="p">(</span><span class="n">logits</span> <span class="o">-</span> <span class="n">logits</span><span class="o">.</span><span class="n">max</span><span class="p">())))</span>
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="o">-</span><span class="n">log_probs</span><span class="p">[</span><span class="n">target</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="n">x</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">array</span><span class="p">([</span><span class="mi">1000</span><span class="p">,</span> <span class="mi">1000</span><span class="p">,</span> <span class="mi">1000</span><span class="p">])</span>  <span class="c1"># valores grandes</span>
</span></span><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="n">softmax_estavel</span><span class="p">(</span><span class="n">x</span><span class="p">))</span>  <span class="c1"># [0.33, 0.33, 0.33], correto e sem NaN</span></span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-21" class="outline-3">
<h3 id="headline-21">
Normas e distâncias
</h3>
<div id="outline-text-headline-21" class="outline-text-3">
<p>
A distância entre dois vetores pode ser medida de vários jeitos, e a escolha muda tudo. Distância Euclidiana (L2) é a mais comum: hipotenusa, menor caminho. Distância Manhattan (L1) soma as diferenças absolutas: como andar em quarteirões. Distância Chebyshev (L∞) pega só a maior diferença entre coordenadas.</p>
<p>
Similaridade de cosseno mede o ângulo, não a magnitude. É a métrica dominante em NLP e embeddings porque dois textos sobre o mesmo assunto têm vetores que apontam na mesma direção, mesmo que um seja muito mais longo que o outro (magnitudes diferentes). Todo banco vetorial (Qdrant, Pinecone, Weaviate) usa similaridade de cosseno como padrão.</p>
<p>
A regularização L1 (LASSO) produz pesos esparsos: muitos pesos viram exatamente zero, o que é seleção automática de features. L2 (Ridge) encolhe todos os pesos proporcionalmente, o que é bom pra multicolinearidade.</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">numpy</span> <span class="k">as</span> <span class="nn">np</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="n">a</span><span class="p">,</span> <span class="n">b</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">array</span><span class="p">([</span><span class="mi">1</span><span class="p">,</span> <span class="mi">0</span><span class="p">]),</span> <span class="n">np</span><span class="o">.</span><span class="n">array</span><span class="p">([</span><span class="mi">0</span><span class="p">,</span> <span class="mi">1</span><span class="p">])</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="s2">&#34;L1:&#34;</span><span class="p">,</span> <span class="n">np</span><span class="o">.</span><span class="n">sum</span><span class="p">(</span><span class="n">np</span><span class="o">.</span><span class="n">abs</span><span class="p">(</span><span class="n">a</span> <span class="o">-</span> <span class="n">b</span><span class="p">)))</span>                 <span class="c1"># 2 (Manhattan)</span>
</span></span><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="s2">&#34;L2:&#34;</span><span class="p">,</span> <span class="n">np</span><span class="o">.</span><span class="n">sqrt</span><span class="p">(</span><span class="n">np</span><span class="o">.</span><span class="n">sum</span><span class="p">((</span><span class="n">a</span> <span class="o">-</span> <span class="n">b</span><span class="p">)</span><span class="o">**</span><span class="mi">2</span><span class="p">)))</span>           <span class="c1"># 1.414 (Euclidiana)</span>
</span></span><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="s2">&#34;Cosseno:&#34;</span><span class="p">,</span> <span class="mi">1</span> <span class="o">-</span> <span class="n">np</span><span class="o">.</span><span class="n">dot</span><span class="p">(</span><span class="n">a</span><span class="p">,</span><span class="n">b</span><span class="p">)</span><span class="o">/</span><span class="p">(</span><span class="n">np</span><span class="o">.</span><span class="n">linalg</span><span class="o">.</span><span class="n">norm</span><span class="p">(</span><span class="n">a</span><span class="p">)</span><span class="o">*</span><span class="n">np</span><span class="o">.</span><span class="n">linalg</span><span class="o">.</span><span class="n">norm</span><span class="p">(</span><span class="n">b</span><span class="p">)))</span>  <span class="c1"># 1.0 (ortogonais)</span></span></span></code></pre></div>
</div>
</div>
</div>
