blog/content/post/ai-math-foundations.org
** Redução de dimensionalidade

PCA (Principal Component Analysis) encontra as direções de maior variância nos dados e projeta tudo nelas. Você centraliza os dados, calcula a matriz de covariância, extrai os autovetores (componentes principais) e projeta. O gráfico de variância explicada acumulada mostra quantos componentes você precisa pra reter 95% da informação.

t-SNE e UMAP são não-lineares: eles preservam distâncias locais (pontos próximos no espaço original ficam próximos na projeção 2D/3D), mas distorcem as globais. São ferramentas de visualização, não de pré-processamento. Não use t-SNE pra reduzir features antes de treinar; use PCA.

#+BEGIN_SRC python
import numpy as np

def pca(X, n_components=2):
    X_centered = X - X.mean(axis=0)
    cov = (X_centered.T @ X_centered) / (len(X) - 1)
    eigenvalues, eigenvectors = np.linalg.eigh(cov)
    idx = np.argsort(eigenvalues)[::-1]
    return X_centered @ eigenvectors[:, idx[:n_components]]

X = np.random.randn(200, 10)
X_proj = pca(X, 2)
print(X_proj.shape)  # (200, 2)
#+END_SRC

** Complexos e Fourier

Números complexos (~a + bi~) são uma ferramenta elegante pra representar rotações. Euler mostrou que ~e^(iθ) = cos(θ) + i·sin(θ)~: a exponencial complexa é um ponto no círculo unitário. Multiplicar por ~e^(iθ)~ gira um vetor em θ radianos.

Os positional encodings dos Transformers usam senos e cossenos de diferentes frequências, que, na forma complexa, são simplesmente ~e^(i·pos·freq)~, rotações de ângulos proporcionais à posição da palavra. RoPE (Rotary Position Embedding) leva isso ao extremo: gira os vetores de atenção por um ângulo que depende da posição, aplicando uma matriz de rotação 2D a pares de dimensões.

A Transformada de Fourier decompõe um sinal em suas frequências constituintes. A FFT (Cooley-Tukey) faz isso em O(N log N) dividindo e conquistando. O teorema da convolução diz que convolução no domínio do tempo = multiplicação no domínio da frequência: ~conv(x, h) = IFFT(FFT(x) * FFT(h))~. Pra kernels grandes, é mais rápido fazer via FFT. O FNet é um transformer que substitui atenção por FFT, indo de O(N²) pra O(N log N).

#+BEGIN_SRC python
import numpy as np

def dft(x):
    N = len(x)
    n = np.arange(N)
    k = n.reshape((N, 1))
    return np.dot(np.exp(-2j * np.pi * k * n / N), x)

signal = np.array([1, 2, 3, 4, 3, 2, 1, 0])
frequencias = np.abs(dft(signal))
print(frequencias)  # pico na frequência dominante
#+END_SRC

