ai-math-foundations/index.html
<div id="outline-container-headline-22" class="outline-3">
<h3 id="headline-22">
Redução de dimensionalidade
</h3>
<div id="outline-text-headline-22" class="outline-text-3">
<p>
PCA (Principal Component Analysis) encontra as direções de maior variância nos dados e projeta tudo nelas. Você centraliza os dados, calcula a matriz de covariância, extrai os autovetores (componentes principais) e projeta. O gráfico de variância explicada acumulada mostra quantos componentes você precisa pra reter 95% da informação.</p>
<p>
t-SNE e UMAP são não-lineares: eles preservam distâncias locais (pontos próximos no espaço original ficam próximos na projeção 2D/3D), mas distorcem as globais. São ferramentas de visualização, não de pré-processamento. Não use t-SNE pra reduzir features antes de treinar; use PCA.</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">numpy</span> <span class="k">as</span> <span class="nn">np</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">pca</span><span class="p">(</span><span class="n">X</span><span class="p">,</span> <span class="n">n_components</span><span class="o">=</span><span class="mi">2</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="n">X_centered</span> <span class="o">=</span> <span class="n">X</span> <span class="o">-</span> <span class="n">X</span><span class="o">.</span><span class="n">mean</span><span class="p">(</span><span class="n">axis</span><span class="o">=</span><span class="mi">0</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="n">cov</span> <span class="o">=</span> <span class="p">(</span><span class="n">X_centered</span><span class="o">.</span><span class="n">T</span> <span class="o">@</span> <span class="n">X_centered</span><span class="p">)</span> <span class="o">/</span> <span class="p">(</span><span class="nb">len</span><span class="p">(</span><span class="n">X</span><span class="p">)</span> <span class="o">-</span> <span class="mi">1</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="n">eigenvalues</span><span class="p">,</span> <span class="n">eigenvectors</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">linalg</span><span class="o">.</span><span class="n">eigh</span><span class="p">(</span><span class="n">cov</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="n">idx</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">argsort</span><span class="p">(</span><span class="n">eigenvalues</span><span class="p">)[::</span><span class="o">-</span><span class="mi">1</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="n">X_centered</span> <span class="o">@</span> <span class="n">eigenvectors</span><span class="p">[:,</span> <span class="n">idx</span><span class="p">[:</span><span class="n">n_components</span><span class="p">]]</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="n">X</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">random</span><span class="o">.</span><span class="n">randn</span><span class="p">(</span><span class="mi">200</span><span class="p">,</span> <span class="mi">10</span><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="n">X_proj</span> <span class="o">=</span> <span class="n">pca</span><span class="p">(</span><span class="n">X</span><span class="p">,</span> <span class="mi">2</span><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="n">X_proj</span><span class="o">.</span><span class="n">shape</span><span class="p">)</span>  <span class="c1"># (200, 2)</span></span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-23" class="outline-3">
<h3 id="headline-23">
Complexos e Fourier
</h3>
<div id="outline-text-headline-23" class="outline-text-3">
<p>
Números complexos (<code>a + bi</code>) são uma ferramenta elegante pra representar rotações. Euler mostrou que <code>e^(iθ) = cos(θ) + i·sin(θ)</code>: a exponencial complexa é um ponto no círculo unitário. Multiplicar por <code>e^(iθ)</code> gira um vetor em θ radianos.</p>
<p>
Os positional encodings dos Transformers usam senos e cossenos de diferentes frequências, que, na forma complexa, são simplesmente <code>e^(i·pos·freq)</code>, rotações de ângulos proporcionais à posição da palavra. RoPE (Rotary Position Embedding) leva isso ao extremo: gira os vetores de atenção por um ângulo que depende da posição, aplicando uma matriz de rotação 2D a pares de dimensões.</p>
<p>
A Transformada de Fourier decompõe um sinal em suas frequências constituintes. A FFT (Cooley-Tukey) faz isso em O(N log N) dividindo e conquistando. O teorema da convolução diz que convolução no domínio do tempo = multiplicação no domínio da frequência: <code>conv(x, h) = IFFT(FFT(x) * FFT(h))</code>. Pra kernels grandes, é mais rápido fazer via FFT. O FNet é um transformer que substitui atenção por FFT, indo de O(N²) pra O(N log N).</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">numpy</span> <span class="k">as</span> <span class="nn">np</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">dft</span><span class="p">(</span><span class="n">x</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="n">N</span> <span class="o">=</span> <span class="nb">len</span><span class="p">(</span><span class="n">x</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="n">n</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">arange</span><span class="p">(</span><span class="n">N</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="n">k</span> <span class="o">=</span> <span class="n">n</span><span class="o">.</span><span class="n">reshape</span><span class="p">((</span><span class="n">N</span><span class="p">,</span> <span class="mi">1</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="n">np</span><span class="o">.</span><span class="n">dot</span><span class="p">(</span><span class="n">np</span><span class="o">.</span><span class="n">exp</span><span class="p">(</span><span class="o">-</span><span class="mi">2</span><span class="n">j</span> <span class="o">*</span> <span class="n">np</span><span class="o">.</span><span class="n">pi</span> <span class="o">*</span> <span class="n">k</span> <span class="o">*</span> <span class="n">n</span> <span class="o">/</span> <span class="n">N</span><span class="p">),</span> <span class="n">x</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="n">signal</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">array</span><span class="p">([</span><span class="mi">1</span><span class="p">,</span> <span class="mi">2</span><span class="p">,</span> <span class="mi">3</span><span class="p">,</span> <span class="mi">4</span><span class="p">,</span> <span class="mi">3</span><span class="p">,</span> <span class="mi">2</span><span class="p">,</span> <span class="mi">1</span><span class="p">,</span> <span class="mi">0</span><span class="p">])</span>
</span></span><span class="line"><span class="cl"><span class="n">frequencias</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">abs</span><span class="p">(</span><span class="n">dft</span><span class="p">(</span><span class="n">signal</span><span class="p">))</span>
</span></span><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="n">frequencias</span><span class="p">)</span>  <span class="c1"># pico na frequência dominante</span></span></span></code></pre></div>
</div>
</div>
</div>
</div>
</div>
